package com.coolcollege.intelligent.model.enums;

import cn.hutool.core.util.ArrayUtil;
import lombok.AllArgsConstructor;
import lombok.Getter;
import org.apache.commons.lang3.StringUtils;

import java.text.MessageFormat;
import java.util.Objects;

/**
 * describe: 萤石云错误代码
 *
 * @author wangff
 * @date 2025/1/7
 */
@Getter
@AllArgsConstructor
public enum YingshiErrorCodeEnum {

    ERROR0("-6", "视频加密", "视频流进行过加密", "需要解密后才能录制"),
    ERROR1("-7", "转封装创建失败", "在转码的过程中发生错误", "需提交工单请技术分析"),
    ERROR2("-8", "帧分析库创建失败", "帧分析库创建失败", "需提交工单请技术分析"),
    ERROR3("-9", "音频编码格式错误", "音频编码格式错误", "云录制目前支持音频格式为：G711或者AAC"),
    ERROR4("-10", "转封装库溢出", "转封装库溢出", "需提交工单请技术分析"),
    ERROR5("-11", "回放片段获取失败", "回放片段获取失败", "请检查调用参数是否正确无误"),
    ERROR6("-12", "上传云存储失败", "上传云存储失败", "需提交工单请技术分析"),
    ERROR7("-16", "查询录像过短", "上传云存储失败", "需提交工单请技术分析"),
    ERROR8("5000", "服务端内部处理异常", "服务端内部错误码", "检测服务端是否正常"),
    ERROR9("5400", "私有化协议vtm检测私有化协议中码流类型小于0或者设备序列号为空等非法参数场景返回(app不重试取流)", "客户端参数出错", "刷新重试"),
    ERROR10("5402", "回放找不到录像文件", "设备回放找不到录像文件", "检查是否有存储卡并且接触良好"),
    ERROR11("5403", "操作码或信令密钥与设备不匹配", "操作码或信令密钥与设备不匹配", ""),
    ERROR12("5404", "设备不在线", "设备不在线", "检查设备网络；重启设备接入萤石云"),
    ERROR13("5405", "流媒体向设备发送或接受信令超时/cas响应超时", "设备回应信令10秒超时", "检查设备网络；重启设备"),
    ERROR14("5406", "token失效", "token失效", "刷新重试或者重启设备"),
    ERROR15("5407", "客户端的URL格式错误", "客户端的URL格式错误", "刷新重试"),
    ERROR16("5409", "预览开启隐私保护", "预览开启隐私保护", ""),
    ERROR17("5411", "token无权限", "token无权限、用户无权限", ""),
    ERROR18("5412", "session不存在", "session不存在", ""),
    ERROR19("5413", "验证token的他异常（不具体）", "token验证失败", "刷新重试"),
    ERROR20("5415", "设备通道错", "设备判断请求通道不存在", "刷新重试"),
    ERROR21("5416", "设备资源受限", "设备资源受限", "刷新重试"),
    ERROR22("5451", "设备不支持的码流类型", "设备不支持的码流类型", "刷新重试或者切换到高清模式"),
    ERROR23("5452", "设备链接流媒体服务器失败", "设备链接流媒体服务器失败", "检查设备网络"),
    ERROR24("5454", "流媒体中关于设备取流会话不存在", "流媒体中关于设备取流会话不存在", ""),
    ERROR25("5455", "设备通道未关联", "设备通道未关联", "检查设备通道是否关联"),
    ERROR26("5456", "设备通道关联设备不在线", "设备通道关联设备不在线", "检查设备通道是否上线"),
    ERROR27("5457", "客户端不支持端到端加密", "客户端不支持端到端加密", ""),
    ERROR28("5458", "设备不支持当前并发ECDH密", "设备不支持当前并发ECDH密", ""),
    ERROR29("5459", "VTDU 处理ECDH 加密失败", "", ""),
    ERROR30("5460", "手表正在拍照或录像", "", "设备错误码：0X00101114"),
    ERROR31("5461", "手表正在视频聊天", "", "设备错误码：0X00101115"),
    ERROR32("5462", "手表正在识图", "", "设备错误码：0X00101116"),
    ERROR33("5463", "手表正在QQ视频", "", "设备错误码：0X00101117"),
    ERROR34("5464", "手表正在坐姿检测", "", "设备错误码：0X00101118"),
    ERROR35("5465", "手表温度过高", "", "设备错误码：0X00101119"),
    ERROR36("5492", "设备不支持的命令", "设备不支持的命令", ""),
    ERROR37("5500", "服务器处理失败", "服务器处理失败", "刷新重试"),
    ERROR38("5503", "vtm返回分配vtdu失败", "vtm返回分配vtdu失败", "vtdu服务异常"),
    ERROR39("5504", "流媒体vtdu达到最大负载", "流媒体vtdu达到最大负载", "服务器负载达到上限"),
    ERROR40("5544", "设备返回无视频源", "", "设备是否接触良好；如果一直无法解决"),
    ERROR41("5545", "视频分享时间已经结束", "", ""),
    ERROR42("5546", "vtdu返回达到取流并发路数限制", "", "请升级为企业版"),
    ERROR43("5547", "vtdu返回开放平台用户并发限制", "", "请确定开放平台用户预览是否超过用户并发数量限制"),
    ERROR44("5556", "ticket校验失败", "", ""),
    ERROR45("5557", "回放服务器等待流头超时", "", "刷新重试"),
    ERROR46("5558", "查找录像开始时间错误", "", ""),
    ERROR47("5560", "群组分享取流二次验证失败", "", ""),
    ERROR48("5561", "分享群组用户被锁住", "", ""),
    ERROR49("5562", "群组分享用户权限变更", "", ""),
    ERROR50("5563", "认证服务连接失败", "", ""),
    ERROR51("5564", "认证超时", "", ""),
    ERROR52("5565", "缓存无效", "", ""),
    ERROR53("5566", "不在分享时间内预览", "", ""),
    ERROR54("5567", "分享通道被锁定", "", ""),
    ERROR55("5568", "未找到认证类型", "", ""),
    ERROR56("5569", "认证返回的参数异常", "", ""),
    ERROR57("5600", "分享设备不在分享时间内", "", ""),
    ERROR58("5601", "群组分享用户没权限", "", ""),
    ERROR59("5602", "群组分享权限变更", "", ""),
    ERROR60("5556", "ticket取流验证失败", "", ""),
    ERROR61("5530", "机房故障不可用", "", "刷新重试"),
    ERROR62("5701", "cas信令返回格式错误", "", "刷新重试"),
    ERROR63("5702", "SPGW请求Cas、Status透传超时", "", "刷新重试"),
    ERROR64("5703", "SPGW请求http不通", "", "刷新重试"),
    ERROR65("6001", "客户端参数出错", "", "刷新重试"),
    ERROR66("6099", "客户端默认错误", "", ""),
    ERROR67("6101", "不支持的命令", "", "刷新重试"),
    ERROR68("6102", "设备流头发送失败", "", "刷新重试"),
    ERROR69("6103", "cas/设备返回错误1", "", "刷新重试"),
    ERROR70("6104", "cas/设备返回错误-1", "", "刷新重试"),
    ERROR71("6105", "设备返回错误码3", "", "刷新重试"),
    ERROR72("6106", "设备返回错误码4", "一般常见于多通道设 备预览 1、通道不存在 2、通道子码流不存在 3、通道不在线", "刷新重试"),
    ERROR73("6107", "设备返回错误码5", "", "刷新重试"),
    ERROR74("6108", "cas信令回应重复", "", "刷新重试"),
    ERROR75("6109", "视频广场取消分享", "", ""),
    ERROR76("6110", "设备信令默认错误", "设备错误返回的错误码", "不具体"),
    ERROR77("6501", "设备数据链路和实际链路不匹配", "", "刷新重试"),
    ERROR78("6502", "设备数据链路重复建立连接", "", "刷新重试"),
    ERROR79("6503", "设备数据链路端口不匹配", "", "刷新重试"),
    ERROR80("6504", "缓存设备数据链路失败(内存块不足)", "", "刷新重试"),
    ERROR81("6505", "设备发送确认头消息重复", "", "刷新重试"),
    ERROR82("6506", "设备数据先于确定头部到达", "", "刷新重试"),
    ERROR83("6508", "设备数据头部长度非法", "", "刷新重试"),
    ERROR84("6509", "索引找不到设备数据管理块", "", "刷新重试"),
    ERROR85("6510", "设备数据链路vtdu内存块协议状态不匹配", "", ""),
    ERROR86("6511", "设备数据头部没有streamkey错误", "", ""),
    ERROR87("6512", "设备数据头部非法(较笼统)", "", ""),
    ERROR88("6513", "设备数据长度过小", "", ""),
    ERROR89("6514", "设备老协议推流头部没有streamkey错误", "", ""),
    ERROR90("6515", "设备老协议推流数据非法", "", ""),
    ERROR91("6516", "设备老协议索引找不到内存管理块", "", ""),
    ERROR92("6517", "设备老协议推流数据非法", "", ""),
    ERROR93("6518", "设备数据包过大", "", "刷新重试"),
    ERROR94("6519", "设备推流链路网络不稳定", "设备长时间未推流超时", ""),
    ERROR95("6520", "设备推流链路网络不稳定(默认)", "设备网络异常", ""),
    ERROR96("7005", "VTDU断开连接", "VTDU断开连接", "大部分为设备断流导致的"),
    ;

    /**
     * 错误码
     */
    private final String errorCode;
    /**
     * 错误描述
     */
    private final String errorMsg;
    /**
     * 释义
     */
    private final String paraphrase;
    /**
     * 解决方案
     */
    private final String solution;

    /**
     * 根据错误码获取错误描述
     * @param errorCode 错误码
     * @return 错误描述
     */
    public static String getMsgByCode(String errorCode) {
        if (StringUtils.isBlank(errorCode) || "0".equals(errorCode)) return null;
        YingshiErrorCodeEnum yingshiErrorCodeEnum = ArrayUtil.firstMatch(v -> v.getErrorCode().equals(errorCode), values());
        return Objects.nonNull(yingshiErrorCodeEnum) ? yingshiErrorCodeEnum.getErrorMsg() : MessageFormat.format("错误码：{0}", errorCode);
    }
}
